In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [2]:
actores = pd.read_csv('actor.csv', encoding='latin1')
df = actores.copy()
df.tail()

     actor_id first_name last_name          last_update
195       196       BELA    WALKEN  2006-02-15 04:34:33
196       197      REESE      WEST  2006-02-15 04:34:33
197       198       MARY    KEITEL  2006-02-15 04:34:33
198       199      JULIA   FAWCETT  2006-02-15 04:34:33
199       200      THORA    TEMPLE  2006-02-15 04:34:33

In [3]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 41.1 KB

In [4]:
df.columns = [c.lower() for c in df.columns] #con esto ponemos todo en minusculas, son buenas practicas

In [5]:
df.columns = df.columns.str.strip() # Ahora eliminamos espacios en blanco al principio y al final de los nombres de las columnas

In [6]:
df.duplicated().sum()  #Duplicados del DataFrame

0

In [7]:
df[df.duplicated(subset=["first_name", "last_name"], keep=False)]

     actor_id first_name last_name          last_update
100       101      SUSAN     DAVIS  2006-02-15 04:34:33
109       110      SUSAN     DAVIS  2006-02-15 04:34:33

In [8]:
df = df.drop(109)

In [9]:
df['actor_id'] = range(1, len(df) + 1) #Reestablezco los valores de actor id

In [10]:
df.reset_index(inplace=True, drop=True) #RESETEAR INDICE

In [11]:
df.tail()

     actor_id first_name last_name          last_update
194       195       BELA    WALKEN  2006-02-15 04:34:33
195       196      REESE      WEST  2006-02-15 04:34:33
196       197       MARY    KEITEL  2006-02-15 04:34:33
197       198      JULIA   FAWCETT  2006-02-15 04:34:33
198       199      THORA    TEMPLE  2006-02-15 04:34:33

In [12]:
df.iloc[106: 115]

     actor_id first_name  last_name          last_update
106       107       GINA  DEGENERES  2006-02-15 04:34:33
107       108     WARREN      NOLTE  2006-02-15 04:34:33
108       109  SYLVESTER       DERN  2006-02-15 04:34:33
109       110    CAMERON  ZELLWEGER  2006-02-15 04:34:33
110       111    RUSSELL     BACALL  2006-02-15 04:34:33
111       112     MORGAN    HOPKINS  2006-02-15 04:34:33
112       113     MORGAN  MCDORMAND  2006-02-15 04:34:33
113       114   HARRISON       BALE  2006-02-15 04:34:33
114       115        DAN     STREEP  2006-02-15 04:34:33

In [13]:
df.columns

Index(['actor_id', 'first_name', 'last_name', 'last_update'], dtype='object')

In [14]:
df = df.drop(["last_update"], axis=1)

In [15]:
df.columns

Index(['actor_id', 'first_name', 'last_name'], dtype='object')

In [16]:
df.to_csv('../src/actor_limpio.csv', index=False) # guardamos en la carpeta src el archivo limpio.

In [17]:
%pip install SQLAlchemy

from sqlalchemy import create_engine

Requirement already satisfied: SQLAlchemy in c:\users\abeln\appdata\local\anaconda3\envs\env1\lib\site-packages (2.0.22)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\abeln\appdata\local\anaconda3\envs\env1\lib\site-packages (from SQLAlchemy) (4.7.1)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\abeln\appdata\local\anaconda3\envs\env1\lib\site-packages (from SQLAlchemy) (3.0.1)
Note: you may need to restart the kernel to use updated packages.

In [18]:
%pip install pymysql

Requirement already satisfied: pymysql in c:\users\abeln\appdata\local\anaconda3\envs\env1\lib\site-packages (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [19]:
import pymysql

In [20]:
str_conn = f'mysql+pymysql://root:a1b2e3l4_IRONHACK@localhost:3306/movies'
cursor = create_engine(str_conn)

In [21]:
df.to_sql(name='actor',
            con=cursor,
            if_exists='replace',
            index=False)

199